Процедура ОбработкаОповещенияПодключенияСерверныхСообщенийБезКонтекста(ДополнительныеПараметры) Экспорт
    
    //Тут обработка ошибок подключения обработчика
    //Сообщить("Обработчик подключен.");
    
КонецПроцедуры

Процедура ОбработкаОповещенияСерверныхСообщенийБезКонтекста(Сообщение, ДополнительныеПараметры) ЭКспорт
    
    //Тут обработка присланного сообщения
    Если Сообщение.Получатели.Содержит(_СерверВзаимодействияПривилегированный.ПолучитьИдентификаторТекущегоПользователя()) Тогда
        Если Сообщение.Данные = "Задания" Тогда
            ПоказатьОповещениеПользователя("Данные заданий",новый ОписаниеОповещения("ОбработкаНажатияЗадания",_КлиентскиеФункции, Сообщение),Сообщение.текст,БиблиотекаКартинок.Внимание48,СтатусОповещенияПользователя.Важное);
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

Процедура ОбработкаНажатияЗадания(Сообщение) Экспорт
    
    Если Сообщение.Действия.Количество() > 0 Тогда
        Если тип("БизнесПроцессСсылка._ЗадачиПоЗаявкам") = ТипЗнч(Сообщение.Действия[0].Значение)  тогда
            ПоказатьЗначение(, _ОбщийМодульСервер.ПоследняяЗадачаПоБП(Сообщение.Действия[0].Значение));
            
        иначе
            ПоказатьЗначение(, Сообщение.Действия[0].Значение);
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры // ОбработкаНажатияЗадания() 