
Функция ДанныеGet(Запрос)
    
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
	Параметры =  ПрочитатьJSON(ЧтениеJSON, Ложь);
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   СУММА(ВЫБОР
        |           КОГДА ВЫБОР
        |                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                       ТОГДА 0
        |                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |               КОНЕЦ * ВЫБОР
        |                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                       ТОГДА 1
        |                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |               КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                       КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                           ТОГДА 0
        |                       ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                   КОНЕЦ * ВЫБОР
        |                       КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                           ТОГДА 1
        |                       ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                   КОНЕЦ КАК ЧИСЛО(12, 0))) <= 0
        |               ТОГДА ВЫБОР
        |                       КОГДА ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))) + 1 <= 0.25
        |                           ТОГДА (ВЫРАЗИТЬ(ВЫБОР
        |                                       КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                           ТОГДА 0
        |                                       ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                                   КОНЕЦ * ВЫБОР
        |                                       КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                           ТОГДА 1
        |                                       ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                                   КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.25 - 1
        |                       КОГДА ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))) + 1 <= 0.5
        |                           ТОГДА (ВЫРАЗИТЬ(ВЫБОР
        |                                       КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                           ТОГДА 0
        |                                       ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                                   КОНЕЦ * ВЫБОР
        |                                       КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                           ТОГДА 1
        |                                       ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                                   КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.5 - 1
        |                       КОГДА ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))) + 1 <= 0.75
        |                           ТОГДА (ВЫРАЗИТЬ(ВЫБОР
        |                                       КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                           ТОГДА 0
        |                                       ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                                   КОНЕЦ * ВЫБОР
        |                                       КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                           ТОГДА 1
        |                                       ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                                   КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.75 - 1
        |                       ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))
        |                   КОНЕЦ
        |           ИНАЧЕ ВЫБОР
        |                   КОГДА ВЫБОР
        |                           КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                               ТОГДА 0
        |                           ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                       КОНЕЦ * ВЫБОР
        |                           КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                               ТОГДА 1
        |                           ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                       КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ КАК ЧИСЛО(12, 0))) <= 0.25
        |                       ТОГДА (ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.25
        |                   КОГДА ВЫБОР
        |                           КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                               ТОГДА 0
        |                           ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                       КОНЕЦ * ВЫБОР
        |                           КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                               ТОГДА 1
        |                           ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                       КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ КАК ЧИСЛО(12, 0))) <= 0.5
        |                       ТОГДА (ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.5
        |                   КОГДА ВЫБОР
        |                           КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                               ТОГДА 0
        |                           ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                       КОНЕЦ * ВЫБОР
        |                           КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                               ТОГДА 1
        |                           ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                       КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ КАК ЧИСЛО(12, 0))) <= 0.75
        |                       ТОГДА (ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.75
        |                   ИНАЧЕ (ВЫРАЗИТЬ(ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ КАК ЧИСЛО(12, 0))) + 1
        |               КОНЕЦ
        |       КОНЕЦ) КАК Часы1,
        |   ВЫБОР
        |       КОГДА ЕСТЬNULL(СоответствиеСБух.ДоговорБух, """") = """"
        |           ТОГДА ""Контрагент "" + ЗаявкаЧекЛисты.Заявка.Контрагент.Наименование + "" / "" + ЕСТЬNULL(ЗаявкаЧекЛисты.Заявка.Проект.Наименование, ""<без проекта>"")
        |       ИНАЧЕ СоответствиеСБух.ДоговорБух
        |   КОНЕЦ КАК ДоговорБух,
        |   НАЧАЛОПЕРИОДА(ВЫБОР
        |           КОГДА НЕ ЗаявкаЧекЛисты.Заявка.ДатаАкта = ДАТАВРЕМЯ(1, 1, 1)
        |               ТОГДА ЗаявкаЧекЛисты.Заявка.ДатаАкта
        |           ИНАЧЕ ЗаявкаЧекЛисты.Дата
        |       КОНЕЦ, МЕСЯЦ) КАК Период,
        |   ЗаявкаЧекЛисты.Заявка.Контрагент КАК Контрагент,
        |   СоответствиеСБух.КонтрагентБух КАК КонтрагентБух,
        |   СУММА(ЗаявкаЧекЛисты.ЧасыКлиенту) КАК Часы
        |ИЗ
        |   регистрсведений._РаботыЗаДень КАК ЗаявкаЧекЛисты
        |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._СоответствиеСБух КАК СоответствиеСБух
        |       ПО ЗаявкаЧекЛисты.Заявка.Контрагент = СоответствиеСБух.Контрагент
        |           И ЗаявкаЧекЛисты.Заявка.Проект = СоответствиеСБух.Проект
        |ГДЕ
        |   ВЫБОР
        |           КОГДА НЕ ЗаявкаЧекЛисты.Заявка.ДатаАкта = ДАТАВРЕМЯ(1, 1, 1)
        |               ТОГДА ЗаявкаЧекЛисты.Заявка.ДатаАкта МЕЖДУ &Дата1 И &Дата2
        |           ИНАЧЕ ЗаявкаЧекЛисты.Дата МЕЖДУ &Дата1 И &Дата2
        |                   И ЗаявкаЧекЛисты.Заявка.Техподдержка
        |       КОНЕЦ
        |   И ЗаявкаЧекЛисты.ЧасыКлиенту <> 0
        |
        |СГРУППИРОВАТЬ ПО
        |   НАЧАЛОПЕРИОДА(ВЫБОР
        |           КОГДА НЕ ЗаявкаЧекЛисты.Заявка.ДатаАкта = ДАТАВРЕМЯ(1, 1, 1)
        |               ТОГДА ЗаявкаЧекЛисты.Заявка.ДатаАкта
        |           ИНАЧЕ ЗаявкаЧекЛисты.Дата
        |       КОНЕЦ, МЕСЯЦ),
        |   ВЫБОР
        |       КОГДА ЕСТЬNULL(СоответствиеСБух.ДоговорБух, """") = """"
        |           ТОГДА ""Контрагент "" + ЗаявкаЧекЛисты.Заявка.Контрагент.Наименование + "" / "" + ЕСТЬNULL(ЗаявкаЧекЛисты.Заявка.Проект.Наименование, ""<без проекта>"")
        |       ИНАЧЕ СоответствиеСБух.ДоговорБух
        |   КОНЕЦ,
        |   ЗаявкаЧекЛисты.Заявка.Контрагент,
        |   СоответствиеСБух.КонтрагентБух";
    
    Запрос.УстановитьПараметр("Дата1", Дата(Параметры.Дата1));
    Запрос.УстановитьПараметр("Дата2", Дата(Параметры.Дата2));
    
    РезультатЗапроса = Запрос.Выполнить().Выбрать();
    
    Ответ = Новый HTTPСервисОтвет(200);
		
		МассивДанных = новый Массив ;
		
		Пока РезультатЗапроса.Следующий() Цикл
            
            Данные = РезультатЗапроса;
            
            ГЛСтруктура = новый Структура;
			ГЛСтруктура.Вставить("ДоговорБух",     строка(Данные.ДоговорБух)); 
			ГЛСтруктура.Вставить("Часы",           строка(Данные.Часы)); 
			ГЛСтруктура.Вставить("Период",           строка(Данные.Период)); 
			
			МассивДанных.Добавить(ГЛСтруктура)
		КонецЦикла;
		
		СтруктураВозврата = новый Структура("entities",МассивДанных) ;
		
		СтрокаВозврата = Сериализовать(СтруктураВозврата);
		
		Ответ.УстановитьТелоИзСтроки(СтрокаВозврата);
		Возврат Ответ;
    Возврат Ответ;
КонецФункции

Функция Сериализовать(Объект) 
	
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Объект);
	Возврат Запись.Закрыть();
	
КонецФункции
