
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Элементы.Блокировка.ТолькоПросмотр = не (РольДоступна("ПолныеПрава") или РольДоступна("_БлокировкаКонтрагентов"));
КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьПоИНН(Команда)
//    // Вставить содержимое обработчика.
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьПоИНН()
//	
//	
//    //ИННЗаполненКорректно = Истина;
//    //
//    //ТекстСообщения = "";
//    //Если ПустаяСтрока(Объект.ИНН) Тогда
//    //	ИННЗаполненКорректно = Ложь;
//    //КонецЕсли;
//    //НастройкиПодключенияКСервисуИППЗаданы = ПартнерыИКонтрагенты.НастройкиПодключенияКСервисуИППЗаданы();
//    //Если СамообслуживаниеКлиентСервер.ЗаполнениеРеквизитовПоДаннымИННВозможно(
//    //	ИННЗаполненКорректно,
//    //	НастройкиПодключенияКСервисуИППЗаданы,
//    //	Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо"),
//    //	Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель"),
//    //	Объект.ОбособленноеПодразделение) Тогда
//    //	РеквизитыКонтрагента = ПартнерыИКонтрагентыВызовСервера.ДанныеКонтрагентаПоИНН(
//    //	ОбщегоНазначенияУТКлиентСервер.ЭтоЮрЛицо(Объект.ЮрФизЛицо),
//    //	Объект.ИНН,
//    //	Неопределено);
//    //	
//    //	ВыполнитьЗаполнениеРеквизитовПоИНН(РеквизитыКонтрагента,,объект);
//    //КонецЕсли;
//	
//КонецПроцедуры
