
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    //{{_КОНСТРУКТОР_ПЕЧАТИ(Печатть описания)
    ТабДок = Новый ТабличныйДокумент;
    ПечатьОписания(ТабДок, ПараметрКоманды);

    ТабДок.ОтображатьСетку = Ложь;
    ТабДок.Защита = Ложь;
    ТабДок.ТолькоПросмотр = Ложь;
    ТабДок.ОтображатьЗаголовки = Ложь;
    ТабДок.Показать();
    //}}
КонецПроцедуры

&НаСервере
Процедура ПечатьОписания(ТабДок, ПараметрКоманды)
    Документы._Заявка.ПечатьОписания(ТабДок, ПараметрКоманды);
КонецПроцедуры
