
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    //Вставить содержимое обработчика.
    ПараметрыФормы = Новый Структура("ОткрыватьВЛюбомСлучае", Истина);
    Ф = ПолучитьФорму("ОбщаяФорма._ОписаниеИзмененийПрограммыУмка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
    Если ф.Открыта() тогда
        Ф.ОбновитьДанные();
    иначе
        Ф.Открыть();      
    КонецЕсли;

КонецПроцедуры
