
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    
    Изменения.Очистить();
    ТД = ТекущийОбъект.Изменения.Получить();
    Если Тип("Структура") = ТипЗнч(ТД) тогда
        Если ТД.Свойство("ОписаниеИзменений") 
            И Тип("ТабличныйДокумент") = ТипЗнч(ТД.ОписаниеИзменений) тогда
            Изменения.Вывести(ТД.ОписаниеИзменений);
        КонецЕсли;
        Если ТД.Свойство("Просмотрели")  
            И Тип("Массив") = ТипЗнч(ТД.Просмотрели) тогда
            Просмотрели.ЗагрузитьЗначения(ТД.Просмотрели);
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    
    ТД = новый Структура;
    ТД.Вставить("ОписаниеИзменений",Изменения);
    ТД.Вставить("Просмотрели",Просмотрели.ВыгрузитьЗначения());
    ТекущийОбъект.Изменения = новый ХранилищеЗначения(ТД);
    
    Текст = "";
    для стр = 1 по Изменения.ВысотаТаблицы цикл
     Строка = "";
       для столбец = 1 по Изменения.ШиринаТаблицы цикл
            Строка = Строка + ?(СокрЛП(Изменения.Область(стр,столбец).Текст) = "","",СокрЛП(Изменения.Область(стр,столбец).Текст) + " ");
        КонецЦикла;  
        Текст = Текст + Строка + ?(Строка = "","",Символы.ПС);
    КонецЦикла;
    ТекущийОбъект.ИзмененияСтрокой = Текст;
    
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
   
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Ключ.Пустой() тогда
        Изменения.Вывести(РегистрыСведений._ОписаниеИзмененийВПрограмме.ПолучитьМакет("Макет").ПолучитьОбласть("Описание"));
        Запись.Период = ТекущаяДата();
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
    ДобавитьСтрокуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуНаСервере()
    Изменения.Вывести(РегистрыСведений._ОписаниеИзмененийВПрограмме.ПолучитьМакет("Макет").ПолучитьОбласть("Описание"),,);
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
    ПериодПриИзмененииНаСервере();
КонецПроцедуры
