
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ОткрыватьВЛюбомСлучае =         Параметры.ОткрыватьВЛюбомСлучае;
    ОбновитьДанные(Отказ); 
    
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
    
    Если Просмотрено тогда 
       _ОбщийМодульСервер.ДобавитьПросмотрено(Периоды.ВыгрузитьЗначения());
   КонецЕсли;
   
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
    
    ПередЗакрытиемНаСервере();
    
КонецПроцедуры


&Насервере
Процедура ОбновитьДанные(Отказ = Ложь) Экспорт    
    
   Данные               = _ОбщийМодульСервер.ПолучитьОписаниеОбновления(ОткрыватьВЛюбомСлучае); 
   
   Периоды.ЗагрузитьЗначения( Данные.Периоды);
   ОписаниеОбновлений   = Данные.Данные;
   Отказ = не Периоды.Количество() и не ОткрыватьВЛюбомСлучае;
   Элементы.Просмотрено.Видимость = не ОткрыватьВЛюбомСлучае;
   Элементы.ОписаниеОбновлений.Редактирование = Ложь;
   Элементы.ОписаниеОбновлений.РежимОтображенияВыделения = РежимОтображенияВыделения.НеОтображать;
    
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
    
    Просмотрено = Ложь;
    ОбновитьДанные();
    
КонецПроцедуры
