
&НаСервере
Процедура ПриОткрытииНаСервере()
    
    Данные = РегистрыСведений._СоответствиеСБух.ПолучитьДанныеБух();
    Если Данные <> Неопределено тогда
        УсловноеОформление.Элементы.Очистить();
        для Каждого стрмас из Данные.entities цикл
            ЗаполнитьЗначенияСвойств(ДанныеБух.Добавить(),стрмас);
            
            
            Элемент = Список.УсловноеОформление.Элементы.Добавить();
            ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
            ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КонтрагентБух.Имя);
            ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
            ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонтрагентБух");
            ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
            ОтборЭлемента.ПравоеЗначение = Ложь;
            ОтборЭлемента.ПравоеЗначение = стрмас.КонтрагентГУИД;
            Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ""+ стрмас.КонтрагентНаименование + " (" + стрмас.КонтрагентГУИД + ")");
            
            Элемент = Список.УсловноеОформление.Элементы.Добавить();
            ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
            ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДоговорБух.Имя);
            ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
            ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДоговорБух");
            ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
            ОтборЭлемента.ПравоеЗначение = Ложь;
            ОтборЭлемента.ПравоеЗначение = стрмас.ДоговорГУИД;
            Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ""+ стрмас.ДоговорНаименование + " (" + стрмас.ДоговорГУИД + ")");
            
        КонецЦикла;
    КонецЕсли;
    
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ПриОткрытииНаСервере();
КонецПроцедуры


&Насервере
Функция  ПолучитьАдресТаблицы()
    Возврат ПоместитьВоВременноеХранилище(ДанныеБух.Выгрузить(),новый УникальныйИдентификатор);
КонецФункции


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    ОткрытьФорму("РегистрСведений._СоответствиеСБух.Форма.ФормаЗаписи",новый Структура("Ключ,ДанныеБух",ВыбраннаяСтрока,ПолучитьАдресТаблицы()),Элемент);
    
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
    //Если  Элементы.Список.ТекущиеДанные <> Неопределено тогда
    //    Элементы.ДанныеБух.ОтборСтрок = Новый ФиксированнаяСтруктура("ДоговорГУИД,КонтрагентГУИД", Элементы.Список.ТекущиеДанные.ДоговорБух,Элементы.Список.ТекущиеДанные.КонтрагентБух);
    //иначе
    //    Элементы.ДанныеБух.ОтборСтрок = Новый ФиксированнаяСтруктура;
    //КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    Отказ = Истина;
    ОткрытьФорму("РегистрСведений._СоответствиеСБух.Форма.ФормаЗаписи",новый Структура("ДанныеБух",ПолучитьАдресТаблицы()),Элемент);
КонецПроцедуры


&НаКлиенте
Процедура СписокПриИзменении(Элемент)
    СписокПриАктивизацииСтроки(Элемент)
КонецПроцедуры


