
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    Дата = ТекущийОбъект.ДатаС;
    ВремяС = минута(ТекущийОбъект.ДатаС) * 60 + час(ТекущийОбъект.ДатаС)*60*60 ;
    ВремяПО = минута(ТекущийОбъект.ДатаПО) * 60 + час(ТекущийОбъект.ДатаПО)*60*60;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    Если ВремяС > ВремяПо тогда
        ОбщегоНазначения.СообщитьПользователю("время по не может быть меньше времени с", ,,,Отказ);
        Возврат;
    КонецЕсли;
    
    
    ТекущийОбъект.ДатаС = Дата + ВремяС;
    ТекущийОбъект.ДатаПо = Дата + ВремяПО;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Время = 8;
    Пока Истина Цикл
        Элементы.ВремяС.СписокВыбора.Добавить(Время*60*60, Формат(Цел(Время),"ЧЦ=2; ЧДЦ=0; ЧВН=") + ?(Время -Цел(Время) = 0 , ":00", ":30"));
        Элементы.ВремяПо.СписокВыбора.Добавить(Время*60*60, Формат(Цел(Время),"ЧЦ=2; ЧДЦ=0; ЧВН=") + ?(Время -Цел(Время) = 0 , ":00", ":30"));
        Время = Время + 0.5;
        Если Время > 18 тогда
           Прервать;
       КонецЕсли;
     КонецЦикла;
     
КонецПроцедуры
