
&НаКлиенте
Процедура КонтактнаяИнформацияПриАктивизацииСтроки(Элемент = Неопределено)
    
    //Если Элементы.КонтактнаяИнформация.ТекущиеДанные = Неопределено тогда Возврат;  КонецЕсли;
    //    
    //    Если Строка(Элементы.КонтактнаяИнформация.ТекущиеДанные.Тип) = "Телефон рабочий"  или Строка(Элементы.КонтактнаяИнформация.ТекущиеДанные.Тип) = "Телефон сотовый" Тогда
    //        Элементы.КонтактнаяИнформацияПредставление.Маска = "+9(999)999-99-99";
    //        Если Элементы.КонтактнаяИнформация.ТекущиеДанные.Представление = "" тогда 
    //            Элементы.КонтактнаяИнформация.ТекущиеДанные.Представление = "+7" 
    //        КонецЕсли;	
    //    Иначе		
    //        Элементы.КонтактнаяИнформацияПредставление.Маска = " ";
    //    КонецЕсли;  	
    //    
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияТипПриИзменении(Элемент)
    КонтактнаяИнформацияПриАктивизацииСтроки()
КонецПроцедуры
