

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    
    Если не ЗначениеЗаполнено(Запись.КодСтроки) тогда
        Запись.КодСтроки = новый УникальныйИдентификатор;
    КонецЕсли;
КонецПроцедуры


//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//    
//    Если Запись.Заявка <> Запись.ИсходныйКлючЗаписи.Заявка и не Запись.ИсходныйКлючЗаписи.Заявка.Пустая() тогда
//        ТекущийОбъект.ДополнительныеСвойства.Вставить("ДокументСтарый",Запись.ИсходныйКлючЗаписи.Заявка);    
//    КонецЕсли;
//    
//КонецПроцедуры


//&НаСервере
//Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
//    мас = Новый  Массив;
//    
//    мас.Добавить(ТекущийОбъект.Заявка);
//    
//    ФоновыеЗадания.Выполнить("_ОбщийМодульСервер.ПеренестиЧлВЗаявку", мас, новый УникальныйИдентификатор);
//    
//КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("ДобавлениеСАРМ") и Запись.Задача.Пустая() тогда
        Элементы.Добавление.Видимость = Ложь;
    КонецЕсли;
    ДатаЗапрета = ДатаЗапретаРедактирования();
    
    Видимость();   // Элементы.Группа1.ТолькоПросмотр = РольДоступна("Полныеправа") или РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок");
    
КонецПроцедуры


&НаКлиенте
Процедура ЧасыПриИзменении(Элемент)
    ОкруглитьДоЧетвертиЧаса(Запись.Часы);
КонецПроцедуры



&НаКлиенте
Процедура ОбновитьВидимость(Элемент)
   Видимость();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
        
    Если  ЗначениеЗаполнено(ДатаЗапрета) и ТекущийОбъект.Дата <= ДатаЗапрета
        и не РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок")
        и не РольДоступна("Полныеправа") тогда
        ОбщегоНазначения.СообщитьПользователю(СтрШаблон("ЧЛ (%1, %2, %3 ) 
        |попадает под дату запрета !!!",ТекущийОбъект.Заявка,ТекущийОбъект.Дата, ТекущийОбъект.Описание),,,,Отказ);
    КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура Видимость()
    
    Если Параметры.Свойство("ДобавлениеСАРМ") и Запись.Задача.Пустая() тогда
        Элементы.Добавление.Видимость = Ложь;
    КонецЕсли;
    ДатаЗапрета = ДатаЗапретаРедактирования();
    
    Если (Запись.Заявка.Проверена 
        или ДатаЗапрета >= Запись.Дата
        или Запись.ЗагруженоСRM)
        и не РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок") 
        и не РольДоступна("Полныеправа") тогда
        ТолькоПросмотр = Истина;
    КонецЕсли;
    
    Элементы.ТехПод.Видимость           = Запись.Заявка.Техподдержка;
    Элементы.НомерСервисДеск.Видимость  = Запись.ВидОбращения = Справочники._ВидыОбращенийТехподдержки.Сервис_деск и Запись.Задача.Пустая();
    Элементы.Задача.Видимость           = не Запись.Задача.Пустая();
    Элементы.Задание.Видимость          = Запись.Задача.Пустая();
    Элементы.Задание_.Видимость          = не Запись.Задача.Пустая();
    
   // Элементы.Группа1.ТолькоПросмотр = РольДоступна("Полныеправа") или РольДоступна("_ИзменениеВыполненныхПроверенныхЗаявок");
    
КонецПроцедуры
