Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
	Возврат Константы[ИмяКонстанты].Получить();
КонецФункции

Функция СоздатьОбсуждениеБезКонтекста(ключОбсужденияСтрока) Экспорт
    
    Попытка
        НовоеОбсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
        НовоеОбсуждение.Отображаемое = ЛОЖЬ;
        НовоеОбсуждение.Ключ = ключОбсужденияСтрока;
        //НовоеОбсуждение.Идентификатор = новый ИдентификаторОбсужденияСистемыВзаимодействия(ИдентификаторОбсуждения);
        НовоеОбсуждение.Записать();
        //Константы.ИдентификторОбсужденияСерверныхСообщенийБезКонтекста.Установить(строка(НовоеОбсуждение.Идентификатор));
        //ПараметрыСеанса.ИдентификторОбсужденияСерверныхСообщенийБезКонтекста = (Строка(НовоеОбсуждение.Идентификатор));
        Возврат НовоеОбсуждение.Идентификатор;
    Исключение
        Возврат Неопределено
    КонецПопытки;
КонецФункции

Функция ПолучитьИДОбсуждения (ключОбсужденияСтрока) Экспорт
    Попытка
        обс  = СистемаВзаимодействия.ПолучитьОбсуждение(ключОбсужденияСтрока);
        ЕСЛИ ОБС = Неопределено ТОГДА
            Возврат   неопределено;
        ИНАЧЕ
            Возврат обс.Идентификатор;
        КонецЕсли;
    Исключение  	
        Возврат   неопределено;
    КонецПопытки;
    
КонецФункции

Процедура ДобавитьТекущегоПользователяВОбсуждение(КлючОбс) Экспорт
	
	Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбс);
	
	Если Обсуждение.Участники.Содержит(СистемаВзаимодействия.ИдентификаторТекущегоПользователя()) Тогда
		Возврат;
	КонецЕсли;
	
	Обсуждение.Участники.Добавить(СистемаВзаимодействия.ИдентификаторТекущегоПользователя());	
	Обсуждение.Записать();
	
КонецПроцедуры

Функция ПолучитьИдентификаторТекущегоПользователя() Экспорт
	Возврат СистемаВзаимодействия.ИдентификаторТекущегоПользователя();
КонецФункции

Процедура СоздатьСообщение(Менеджер,Проверка = Ложь, Ссылка = Неопределено,Текст) Экспорт
    Попытка
        Если СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
            
            КлючОбсужденияСтрока = Строка(Константы._ИдентификторОбсужденияСерверныхСообщенийБезКонтекста.Получить());
            Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(КлючОбсужденияСтрока);
            
            ОтветственныйПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Менеджер.ИдентификаторПользователяИБ);
            Если ОтветственныйПользовательИБ = Неопределено  тогда  
                возврат    
            КонецЕсли;
            
            ИдентификаторПользователяСВ = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ОтветственныйПользовательИБ.УникальныйИдентификатор);
            
            НовоеСообщение = СистемаВзаимодействия.СоздатьСообщение(Обсуждение.Идентификатор);
            НовоеСообщение.Данные = "Задания";
            НовоеСообщение.Получатели.Добавить(ИдентификаторПользователяСВ);
            НовоеСообщение.Дата = ТекущаяДата();
            
            Если ЗначениеЗаполнено(Ссылка) Тогда
                Шаблон = Текст;//НСтр("ru = 'У вас, %1, новое задание: %2!'");
                НовоеСообщение.Текст = Шаблон;//СтрШаблон(Шаблон, Менеджер, Ссылка);
                НовоеСообщение.Действия.Добавить(Ссылка); // Ссылка на заявку
                
            Иначе
                Шаблон = Текст;//НСтр("ru = 'У вас, %1, новое задание!'");
                НовоеСообщение.Текст = Шаблон;//(Шаблон, Менеджер);
            КонецЕсли;
            
            НовоеСообщение.Записать();
            
        Иначе 
            Если проверка тогда
                Сообщить("не подключена система взаимодействия");
            КонецЕсли;
        КонецЕсли;
    Исключение
        Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
    КонецПопытки;

КонецПроцедуры

 Функция УстановитьНовыйИДОбсуждения() Экспорт
	ИдентификаторОбсужденияСтрока = новый УникальныйИдентификатор;
	Константы._ИдентификторОбсужденияСерверныхСообщенийБезКонтекстаа.Установить(ИдентификаторОбсужденияСтрока);
	возарат = ИдентификаторОбсужденияСтрока;
КонецФункции
