
&НаКлиенте
Процедура СписокПользователейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейПередУдалением(Элемент, Отказ)
    Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Разослать(Команда)
    ОповеститьОВыборе(СписокПользователей.Скопировать());
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Для каждого стр Из Параметры.Список Цикл
        Если не стр.пустая() тогда
            СписокПользователей.Добавить(стр,,Истина,БиблиотекаКартинок.Пользователь);
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры
