
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    
    Попытка
        КогоПредупреждатьОбОтпусках.ЗагрузитьЗначения(
            Константы._КогоПредупреждатьОбОтпусках.Получить().Получить()); 
    Исключение
    КонецПопытки;
    
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    Константы._КогоПредупреждатьОбОтпусках.Установить( 
        Новый ХранилищеЗначения(КогоПредупреждатьОбОтпусках.ВыгрузитьЗначения()));
    
КонецПроцедуры
