
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    аДанныеБух = Неопределено;
    Если Параметры.Свойство("ДанныеБух",аДанныеБух)  тогда
        ДанныеБух.Загрузить(ПолучитьИзВременногоХранилища(аДанныеБух));
    КонецЕсли;
    КонтрагентыБух = ДанныеБух.Выгрузить();
    КонтрагентыБух.Свернуть("КонтрагентГУИД,КонтрагентНаименование");
    для Каждого  стр из КонтрагентыБух Цикл 
        Элементы.КонтрагентБух.СписокВыбора.Добавить(стр.КонтрагентГУИД, стр.КонтрагентНаименование);
    КонецЦикла;
     СписокДоговор();
КонецПроцедуры

&НаСервере
Процедура СписокДоговор()
    Элементы.ДоговорБух.СписокВыбора.Очистить();
    для Каждого  стр из ДанныеБух.НайтиСтроки(новый Структура("КонтрагентГУИД",запись.КонтрагентБух)) Цикл 
        Элементы.ДоговорБух.СписокВыбора.Добавить(стр.ДоговорГУИД, стр.ДоговорНаименование);
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентБухПриИзменении(Элемент)
    запись.ДоговорБух = "";
    СписокДоговор();
КонецПроцедуры
