
&НаСервере
Процедура ПриИзмененииНаСервере()
	
	Элементы.КонтрагентСсылка.Видимость = не ЗначениеЗаполнено(КонтрагентСтрока);
	Элементы.КонтрагентСтрока.Видимость = не ЗначениеЗаполнено(КонтрагентСсылка);
	Элементы.КонтактноеЛицоСсылка.Видимость = не ЗначениеЗаполнено(КонтактноеЛицоСтрока);
	Элементы.КонтактноеЛицоСтрока.Видимость = не ЗначениеЗаполнено(КонтактноеЛицоСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзменении(Элемент = Неопределено)
	
	ПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если  ЗначениеЗаполнено(КонтрагентСтрока) тогда
		Запись.Контрагент  =  КонтрагентСтрока;
	Иначе 
		Запись.Контрагент  =  КонтрагентСсылка;
	КонецЕсли;
	
	Если  ЗначениеЗаполнено(КонтактноеЛицоСтрока) тогда
		Запись.КонтактноеЛицо  =  КонтактноеЛицоСтрока;
	Иначе 
		Запись.КонтактноеЛицо  =  КонтактноеЛицоСсылка;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если  ТипЗнч(Запись.Контрагент ) = Тип("СправочникСсылка._Контрагенты") тогда
		КонтрагентСтрока = "";
		КонтрагентСсылка = Запись.Контрагент;
	ИначеЕсли ТипЗнч(Запись.Контрагент ) = Тип("Строка") тогда
		КонтрагентСтрока = Запись.Контрагент;
		КонтрагентСсылка = "";
	КонецЕсли;
	
	Если  ТипЗнч(Запись.КонтактноеЛицо ) = Тип("СправочникСсылка._КонтактныеЛица") тогда
		КонтактноеЛицоСтрока = "";
		КонтактноеЛицоСсылка = Запись.КонтактноеЛицо;
	ИначеЕсли ТипЗнч(Запись.КонтактноеЛицо ) = Тип("Строка") тогда
		КонтактноеЛицоСтрока = Запись.КонтактноеЛицо;
		КонтактноеЛицоСсылка = "";
	КонецЕсли;
	ПриИзмененииНаСервере();
	
	Элементы.КОбработке.ТолькоПросмотр = Запись.Период < НачалоДня( ТекущаяДата());
	Элементы.ГруппаОсновная.ТолькоПросмотр = Запись.Период < НачалоДня( ТекущаяДата());
КонецПроцедуры


&НаСервере
Процедура ОповеститьСотрудникаНаСервере(строка)
	Если не СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда    Возврат КонецЕсли;
	Если не ЗначениеЗаполнено(запись.КогоСпрашивали) Тогда Сообщить("заполните получателя оповещения (Кого спрашивали)");   Возврат КонецЕсли;
	Если запись.ИсходныйКлючЗаписи.Пустой() тогда Записать(); КонецЕсли;
	ИД = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(запись.КогоСпрашивали.ИдентификаторПользователяИБ);
	ОбсуждениеСВ = СистемаВзаимодействия.ПолучитьОбсуждение(ЗначениеВСтрокуВнутр(Запись)); 
	Если ОбсуждениеСВ = неопределено тогда
		ОбсуждениеСВ = СистемаВзаимодействия.СоздатьОбсуждение();
		ОбсуждениеСВ.Отображаемое = Истина;
		ОбсуждениеСВ.Ключ = ЗначениеВСтрокуВнутр(Запись);
		ОбсуждениеСВ.Заголовок = "Необходим ответ на звонок "+ Запись.КонтактноеЛицо ;
	КонецЕсли;
	Если не ОбсуждениеСВ.Участники.Содержит(СистемаВзаимодействия.ИдентификаторТекущегоПользователя()) Тогда
		ОбсуждениеСВ.Участники.Добавить( СистемаВзаимодействия.ИдентификаторТекущегоПользователя()); 
	КонецЕсли;
	Если не ОбсуждениеСВ.Участники.Содержит(ИД) Тогда
		ОбсуждениеСВ.Участники.Добавить( ИД); 
	КонецЕсли;
	
	ОбсуждениеСВ.Записать();
	
	
	Сообщение = СистемаВзаимодействия.СоздатьСообщение(ОбсуждениеСВ.Идентификатор); 
	Сообщение.Текст = ?(строка = "","",строка+Символы.ПС) + "Необходим ответ на звонок " + Запись.КонтактноеЛицо + " из " + запись.Контрагент + " от " + Формат(запись.Период,"ДФ='dd.MM.yyyy HH:mm'") + Символы.ПС +
	запись.Комментарий;
	
	Сообщение.Получатели.Добавить(ИД);
	Сообщение.Записать() ;
	
КонецПроцедуры


&НаКлиенте
Процедура ОповеститьСотрудника(Команда)
	строка = "";
	ПоказатьВводСтроки(новый ОписаниеОповещения("конецвводаСтроки",ЭтаФорма),строка,"введите доп сообщение сотруднику,оно будет вставлено вначале сообщения ",,Истина);
КонецПроцедуры

&НаКлиенте
Процедура конецвводаСтроки(строка,ДП) Экспорт
	ОповеститьСотрудникаНаСервере(строка);
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
	Если Запись.ИсходныйКлючЗаписи.Пустой() тогда
		запись.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработаноПриИзмененииНаСервере()
	Запись.Обработал = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаКлиенте
Процедура ОбработаноПриИзменении(Элемент)
	ОбработаноПриИзмененииНаСервере();
КонецПроцедуры



