Функция  ВернутьМакетШапки(ПолучатьВсеИзменения) Экспорт
    
    
    Данные = новый ТабличныйДокумент;
    Периоды = новый Массив;
    
    Шапка = ПолучитьМакет("Макет").ПолучитьОбласть("Шапка");
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   _ОписаниеИзмененийВПрограмме.Период КАК Период,
    |   _ОписаниеИзмененийВПрограмме.Изменения КАК Изменения
    |ИЗ
    |   РегистрСведений._ОписаниеИзмененийВПрограмме КАК _ОписаниеИзмененийВПрограмме
    |
    |УПОРЯДОЧИТЬ ПО
    |   Период УБЫВ";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    Данные.НачатьАвтогруппировкуСтрок();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        
        ТД = ВыборкаДетальныеЗаписи.Изменения.Получить();
        Если Тип("Структура") = ТипЗнч(ТД) тогда
            
            Если не ПолучатьВсеИзменения и ТД.Свойство("Просмотрели")  
                И Тип("Массив") = ТипЗнч(ТД.Просмотрели) тогда
                Если ТД.Просмотрели.Найти(ПараметрыСеанса.ТекущийПользователь) <> Неопределено тогда 
                    Продолжить; 
                КонецЕсли;
            ИначеЕсли не ПолучатьВсеИзменения тогда 
                Продолжить; 
            КонецЕсли;
            
            Если ТД.Свойство("ОписаниеИзменений") 
                И Тип("ТабличныйДокумент") = ТипЗнч(ТД.ОписаниеИзменений) тогда
                Шапка.Параметры.Дата =  Формат(ВыборкаДетальныеЗаписи.Период,"ДФ='dd.MM.yyyy ЧЧ:мм'");
                Данные.Вывести(Шапка,1);
                Данные.Вывести(ТД.ОписаниеИзменений,2);
            КонецЕсли;
            Периоды.Добавить(ВыборкаДетальныеЗаписи.Период); 
        КонецЕсли;
        
        
    КонецЦикла;
    Данные.ЗакончитьАвтогруппировкуСтрок();
    
    Возврат новый Структура("Данные,Периоды",Данные,Периоды);
    
КонецФункции