
// <Описание процедуры>
// Параметры:
//  Форма  - Форма
//  Таблица  - Строка - таблица формы
//  Поле  - Строка - поле сравнения
//  ВидСравнения   - ВидСравнениякомпоновкиДанных
//  значение  - значение сранения
//  ЗначениеОформления  - значение параметра оформления
//  Параметр - Строка  - что оформлять 
//  ПолеДляОформления- Строка  - какое поле оформлять 
Процедура ОформлениеДинСписка(Форма, Таблица,Поле,ВидСравнения,значение,ЗначениеОформления, Параметр = "ЦветФона", ПолеДляОформления = Неопределено )   Экспорт
    
    ЭлементОформления = Форма[Таблица].УсловноеОформление.Элементы.Добавить();
    ЭлементОформления.Использование = Истина;
    
    ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Поле); 
    ЭлементОтбора.ВидСравнения = ВидСравнения; 
    ЭлементОтбора.ПравоеЗначение = значение;
    
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра(Параметр, ЗначениеОформления);
    
    Если ПолеДляОформления <> Неопределено тогда
        ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
        ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ПолеДляОформления);
    КонецЕсли;
    
КонецПроцедуры 

Процедура ОкруглитьДоЧетвертиЧаса(Часы) Экспорт

    целое = цел(Часы);
    часть = Часы - целое;
    //округляем до четверти часа 
    Если часть > 0.75 Тогда 
        часть = 1;
    ИначеЕсли  часть > 0.5 Тогда
        часть = 0.75;
    ИначеЕсли  часть > 0.25 Тогда
        часть = 0.5;
    ИначеЕсли  часть > 0 Тогда
        часть = 0.25;
    КонецЕсли;        
    Часы = целое + часть;


КонецПроцедуры
 
&НаКлиенте
Процедура _ОткрытьФайл(Элемент, ТекущиеДанные, Поле, СтандартнаяОбработка,УникальныйИдентификатор)   Экспорт 
    
    СтандартнаяОбработка = Ложь;
   
    КакОткрывать = РаботаСФайламиСлужебныйКлиент.ПерсональныеНастройкиРаботыСФайлами().ДействиеПоДвойномуЩелчкуМыши;
    
    Если КакОткрывать = "ОткрыватьКарточку" Тогда
        ПоказатьЗначение(, ТекущиеДанные);
        Возврат;
    КонецЕсли;
    
    ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекущиеДанные,
    Неопределено, УникальныйИдентификатор, Неопределено,);
    
    ПараметрыОбработчика = Новый Структура;
    ПараметрыОбработчика.Вставить("ДанныеФайла", ДанныеФайла);
    РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
    
КонецПроцедуры

&НаСервере
Функция ДатаЗапретаРедактирования() Экспорт

    Даты = ДатыЗапретаИзмененияСлужебный.РассчитанныеДатыЗапретаИзменения();
    Если даты.найти(ПараметрыСеанса.ТекущийПользователь)= Неопределено тогда
        ДатаЗапрета = даты.найти(Перечисления.ВидыНазначенияДатЗапрета.ДляВсехПользователей).ДатаЗапрета;
    иначе
        Попытка
            ДатаЗапрета = даты.найти(ПараметрыСеанса.ТекущийПользователь).ДатаЗапрета;
        Исключение
            ДатаЗапрета = Дата(1,1,1);
        КонецПопытки;
        
    КонецЕсли;
    Возврат ДатаЗапрета;	

КонецФункции // ДатаЗапретаРедактирования()
