&НаСервере
Процедура ПолучитьФайл(ТекущаяСтрока, Файл)
    
    Файл = ТекущаяСтрока.Файл.Получить()
    
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()

    //
    //Для Каждого тСтр Из Список Цикл
    //    
    //    Элементы.СтруктураСпец.Развернуть(тСтр.ПолучитьИдентификатор(), Истина);
    //    
    //КонецЦикла;
  
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриСменеТекущегоРодителя(Элемент)
    // Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Функция  СписокПриАктивизацииСтроки(Элемент)
    //СписокПриАктивизацииСтрокиНаСервере();
    Файл = Неопределено;
    ПолучитьФайл(Элементы.список.ТекущаяСтрока,Файл);
    
    //Если СтрНайти(НРег(Расширение(Элементы.список.ТекущаяСтрока) ),"xls")>0 тогда
    //    НовыйФайл = ПолучитьИмяВременногоФайла("mxl"); //тут я просто предопределенный формат файла выставил но он может быть любой
    //иначе
        НовыйФайл = КаталогВременныхФайлов() + "\" + Расширение(Элементы.список.ТекущаяСтрока,Истина); //тут я просто предопределенный формат файла выставил но он может быть любой
   // КонецЕсли;
    Если ТипЗнч(Файл) = тип("ДвоичныеДанные") тогда
        Файл.Записать(НовыйФайл);
    КонецЕсли;
    // Попытка 
    // Поле = НовыйФайл;
    // Исключение
    //ЗапуститьПриложение(НовыйФайл);
    //КонецПопытки;
КонецФункции

&НаСервере
Функция  Расширение(ТекущаяСтрока, ПолучатьСимененм = Ложь)
    
    Возврат  ?(ПолучатьСИмененм, ТекущаяСтрока.ИмяФайла + ".","") + ТекущаяСтрока.Расширение;   
    
КонецФункции

&НаКлиенте
Процедура ПолеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
    // Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПолеДокументСформирован(Элемент)
    // Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьВПрограмме(Команда)
    
    Ф = ОткрытьФорму("Справочник._ВопросыИОтветы.Форма.ФормаОжидания");
    Возв = 0;
    НачатьЗапускПриложения(новый ОписаниеОповещения("ОткрытьВПрограммеЗавершение",ЭтаФорма,Ф),НовыйФайл,,Истина);
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВПрограммеЗавершение(Код, ДП) Экспорт
    
    Попытка
        ДП.Закрыть();
    Исключение
    КонецПопытки;
    
КонецПроцедуры



&НаКлиенте
Процедура ОткрытьВ1С(Команда)
    
    _ОбщийМодуль_Клиент.ОткрытьВ1С(Элементы.Список.ТекущаяСтрока);
    
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
        
    СтандартнаяОбработка = Ложь;
   
    Если не ЕстьПодчиненные(Элементы.Список.ТекущаяСтрока) и не Элементы.Список.ТекущиеДанные.ИмяФайла = ""	тогда
        ОткрытьВПрограмме(Неопределено)
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция  ЕстьПодчиненные(Элемент)
    
     Возврат Справочники._ВопросыИОтветы.Выбрать(Элемент).Следующий()
     
КонецФункции

