///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;

// Конец СтандартныеПодсистемы

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
    
    // СтандартныеПодсистемы
    СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
    // Конец СтандартныеПодсистемы
    
    
    
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
    
    // СтандартныеПодсистемы
    СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
    // Конец СтандартныеПодсистемы
    ПодключениеСистемыВзаимодействия();
    
    
    //каждый час проверка изменений
    ПоказатьИзменениявПрограмме();
    ПодключитьОбработчикОжидания("ПоказатьИзменениявПрограмме",60*60,Ложь);
    
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИзменениявПрограмме()  Экспорт
    Попытка
        Ф = ПолучитьФорму("ОбщаяФорма._ОписаниеИзмененийПрограммыУмка");
        Если Ф <> Неопределено и ф.Открыта() тогда
            Ф.ОбновитьДанные();
        ИначеЕсли Ф <> Неопределено тогда 
            Ф.Открыть();      
        КонецЕсли;
    Исключение
    КонецПопытки;
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
    
    // СтандартныеПодсистемы
    СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
    // Конец СтандартныеПодсистемы
    
КонецПроцедуры

#КонецОбласти

Процедура ПодключениеСистемыВзаимодействия()
    
    Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
        Возврат;
    КонецЕсли;         
    
    ключОбсужденияСтрока = _СерверВзаимодействияПривилегированный.ПолучитьЗначениеКонстанты("_ИдентификторОбсужденияСерверныхСообщенийБезКонтекста");
    Если не ЗначениеЗаполнено(ключОбсужденияСтрока) Тогда
        ключОбсужденияСтрока = _СерверВзаимодействияПривилегированный.УстановитьНовыйИДОбсуждения();
    КонецЕсли;
    
    ИД  = _СерверВзаимодействияПривилегированный.ПолучитьИДОбсуждения(ключОбсужденияСтрока) ;
    Если ИД = Неопределено Тогда
        ИД   = _СерверВзаимодействияПривилегированный.СоздатьОбсуждениеБезКонтекста(ключОбсужденияСтрока);
    КонецЕсли;
    Если ид = Неопределено тогда Возврат КонецЕсли;
    _СерверВзаимодействияПривилегированный.ДобавитьТекущегоПользователяВОбсуждение(ключОбсужденияСтрока);
    
    ОписаниеОповещенияПодключенияОбработчика = Новый ОписаниеОповещения("ОбработкаОповещенияПодключенияСерверныхСообщенийБезКонтекста", _КлиентскиеФункции,);
    ОписаниеОповещенияСерверныхСообщенийБезКонтекста = Новый ОписаниеОповещения("ОбработкаОповещенияСерверныхСообщенийБезКонтекста", _КлиентскиеФункции,);
    СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(ОписаниеОповещенияПодключенияОбработчика, ИД, ОписаниеОповещенияСерверныхСообщенийБезКонтекста);
    
    
КонецПроцедуры 

