
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    //Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
    
    Если Объект.Ссылка.Пустая() тогда
        Объект.Порядок = объект.Родитель.Порядок + ".";
    КонецЕсли;

    ЗадатьМаску();
    
КонецПроцедуры

&НаКлиенте

Процедура ПриОткрытии(Отказ)
    
    Если Объект.Ссылка.Пустая() тогда
        Загрузить(Неопределено) ;
    КонецЕсли;
    
    ПриОткрытииНаСервере();
    
КонецПроцедуры

&НаСервере
Процедура ЗадатьМаску()
    
    //Элементы.Порядок.Маска = объект.Родитель.Порядок + ?(объект.Родитель.Порядок = "","",".") + "999999999";   
    
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)

    
    Адрес = "";
    НачальноеИмяФайла = "";
    ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьЗавершение", ЭтаФорма);
    НачатьПомещениеФайла(ОписаниеОповещения, Адрес, НачальноеИмяФайла, Истина, УникальныйИдентификатор); 
    
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершение(Результат, Адрес, ВыбранныйФайл, ДополнительныеПараметры) Экспорт
	
    Если НЕ Результат Тогда
    Если Объект.Ссылка.Пустая() тогда
        Закрыть();
    КонецЕсли;
        Возврат;
    КонецЕсли;

    Модифицированность = Истина;
    Файл = Новый Файл(ВыбранныйФайл);
    Объект.Имяфайла = Файл.ИмяБезРасширения;
    Объект.Расширение = Файл.Расширение;
    //Объект.Наименование = Файл.ИмяБезРасширения;
    // для записи в реквизит с типом хранилище значения
    АдресЗагруженногоФайла = Адрес;
			
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    Если ЭтоАдресВременногоХранилища(АдресЗагруженногоФайла) Тогда
        
        ЗагруженныйФайл = ПолучитьИзВременногоХранилища(АдресЗагруженногоФайла);
        ЭлементХранилища = Новый ХранилищеЗначения(ЗагруженныйФайл);
        ТекущийОбъект.Файл = ЭлементХранилища;
        
    КонецЕсли; 
    
КонецПроцедуры
