Функция  ПолучитьДанные(НачалоПериода, КонецПериода, ВидПоискаКонтрагента, СтрокаПоискаКонтрагента, ВидОтчета)   Экспорт
    
    
    ///{NachPeriod}/{OkonchPeriod}/{VidKontr}/{Kontr}/{VidOtch}
    Если Месяц(НачалоПериода) < Месяц(КонецПериода) тогда
        период = "Обслуживание программного продукта 1с за "+НРег(формат(НачалоПериода,"ДФ='MMMM -'")+ Формат(КонецПериода,"ДФ=' MMMM yyyy'")); 
    иначе
        период = "Обслуживание программного продукта 1с за "+НРег(формат(НачалоПериода,"ДФ=' MMMM yyyy'")); 
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   СУММА(ЗаявкаЧекЛисты.ЧасыКлиенту) КАК ЧасыКлиенту,  " + ?(НРег(ВидОтчета) = "кратко"," """+Период+""" КАК Название  "," 
    |   ЗаявкаЧекЛисты.Заявка.Название КАК Название ") + "
    |ИЗ
    |   РегистрСведений._РаботыЗаДень КАК ЗаявкаЧекЛисты
    |ГДЕ    ЗаявкаЧекЛисты.ЧасыКлиенту<>0 и 
    |   ВЫБОР
    |           КОГДА НЕ ЗаявкаЧекЛисты.Заявка.ДатаАкта = ДАТАВРЕМЯ(1, 1, 1)
    |                  
    |               ТОГДА ЗаявкаЧекЛисты.Заявка.ДатаАкта МЕЖДУ &НачалоПериода И &КонецПериода
    |           иначе ЗаявкаЧекЛисты.Дата МЕЖДУ &НачалоПериода И &КонецПериода
    |                       И ЗаявкаЧекЛисты.Заявка.Техподдержка
    |           
    |       КОНЕЦ
    |   И ВЫБОР
    |           КОГДА &ВидПоискаКонтрагента = ""ИНН""
    |               ТОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.ИНН = &СтрокаПоискаКонтрагента
    |           ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.Наименование = &СтрокаПоискаКонтрагента
    |       КОНЕЦ " + ?(НРег(ВидОтчета) = "кратко","","
    |
    |СГРУППИРОВАТЬ ПО
    |   ЗаявкаЧекЛисты.Заявка.Название");
    
    
    Запрос.Текст = СтрЗаменить(запрос.Текст,"(ЗаявкаЧекЛисты.ЧасыКлиенту)","(ВЫБОР
    |		КОГДА ВЫБОР
    |				КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |					ТОГДА 0
    |				ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |			КОНЕЦ * ВЫБОР
    |				КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |					ТОГДА 1
    |				ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |			КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
    |					КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |						ТОГДА 0
    |					ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |				КОНЕЦ * ВЫБОР
    |					КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |						ТОГДА 1
    |					ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |				КОНЕЦ КАК ЧИСЛО(12, 0))) <= 0
    |			ТОГДА ВЫБОР
    |					КОГДА ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |								ТОГДА 0
    |							ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |						КОНЕЦ * ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |								ТОГДА 1
    |							ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |						КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |									ТОГДА 0
    |								ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |							КОНЕЦ * ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |									ТОГДА 1
    |								ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |							КОНЕЦ КАК ЧИСЛО(12, 0))) + 1 <= 0.25
    |						ТОГДА (ВЫРАЗИТЬ(ВЫБОР
    |									КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |										ТОГДА 0
    |									ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |								КОНЕЦ * ВЫБОР
    |									КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |										ТОГДА 1
    |									ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |								КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.25 - 1
    |					КОГДА ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |								ТОГДА 0
    |							ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |						КОНЕЦ * ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |								ТОГДА 1
    |							ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |						КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |									ТОГДА 0
    |								ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |							КОНЕЦ * ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |									ТОГДА 1
    |								ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |							КОНЕЦ КАК ЧИСЛО(12, 0))) + 1 <= 0.5
    |						ТОГДА (ВЫРАЗИТЬ(ВЫБОР
    |									КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |										ТОГДА 0
    |									ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |								КОНЕЦ * ВЫБОР
    |									КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |										ТОГДА 1
    |									ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |								КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.5 - 1
    |					КОГДА ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |								ТОГДА 0
    |							ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |						КОНЕЦ * ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |								ТОГДА 1
    |							ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |						КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |									ТОГДА 0
    |								ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |							КОНЕЦ * ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |									ТОГДА 1
    |								ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |							КОНЕЦ КАК ЧИСЛО(12, 0))) + 1 <= 0.75
    |						ТОГДА (ВЫРАЗИТЬ(ВЫБОР
    |									КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |										ТОГДА 0
    |									ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |								КОНЕЦ * ВЫБОР
    |									КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |										ТОГДА 1
    |									ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |								КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.75 - 1
    |					ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |									ТОГДА 0
    |								ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |							КОНЕЦ * ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |									ТОГДА 1
    |								ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |							КОНЕЦ КАК ЧИСЛО(12, 0))
    |				КОНЕЦ
    |		ИНАЧЕ ВЫБОР
    |				КОГДА ВЫБОР
    |						КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |							ТОГДА 0
    |						ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |					КОНЕЦ * ВЫБОР
    |						КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |							ТОГДА 1
    |						ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |					КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |								ТОГДА 0
    |							ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |						КОНЕЦ * ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |								ТОГДА 1
    |							ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |						КОНЕЦ КАК ЧИСЛО(12, 0))) <= 0.25
    |					ТОГДА (ВЫРАЗИТЬ(ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |									ТОГДА 0
    |								ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |							КОНЕЦ * ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |									ТОГДА 1
    |								ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |							КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.25
    |				КОГДА ВЫБОР
    |						КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |							ТОГДА 0
    |						ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |					КОНЕЦ * ВЫБОР
    |						КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |							ТОГДА 1
    |						ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |					КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |								ТОГДА 0
    |							ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |						КОНЕЦ * ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |								ТОГДА 1
    |							ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |						КОНЕЦ КАК ЧИСЛО(12, 0))) <= 0.5
    |					ТОГДА (ВЫРАЗИТЬ(ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |									ТОГДА 0
    |								ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |							КОНЕЦ * ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |									ТОГДА 1
    |								ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |							КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.5
    |				КОГДА ВЫБОР
    |						КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |							ТОГДА 0
    |						ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |					КОНЕЦ * ВЫБОР
    |						КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |							ТОГДА 1
    |						ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |					КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |								ТОГДА 0
    |							ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |						КОНЕЦ * ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |								ТОГДА 1
    |							ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |						КОНЕЦ КАК ЧИСЛО(12, 0))) <= 0.75
    |					ТОГДА (ВЫРАЗИТЬ(ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |									ТОГДА 0
    |								ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |							КОНЕЦ * ВЫБОР
    |								КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |									ТОГДА 1
    |								ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |							КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.75
    |				ИНАЧЕ (ВЫРАЗИТЬ(ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
    |								ТОГДА 0
    |							ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
    |						КОНЕЦ * ВЫБОР
    |							КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
    |								ТОГДА 1
    |							ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
    |						КОНЕЦ КАК ЧИСЛО(12, 0))) + 1
    |			КОНЕЦ
    |	КОНЕЦ)");
    
    Запрос.УстановитьПараметр("ВидПоискаКонтрагента", ВидПоискаКонтрагента);
    Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
    Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
    Запрос.УстановитьПараметр("СтрокаПоискаКонтрагента", СтрокаПоискаКонтрагента);
    Данные = Запрос.Выполнить().Выбрать();
    Массив = новый Массив ;
    
    пока Данные.Следующий() Цикл
        
        Структура = новый Структура;
        Структура.Вставить("Часы",Формат(Данные.ЧасыКлиенту,"ЧЦ=10; ЧДЦ=2; ЧГ=0"));
        Структура.Вставить("Описание",СокрЛП(Данные.Название));
        
        Массив.Добавить(Структура)
        
    КонецЦикла;
    
    СтруктураВозврата = новый Структура("Таблица",Массив) ;
    СтрокаВозврата = Сериализовать(СтруктураВозврата);
    
    Ответ = (СтрокаВозврата);
    Возврат Ответ;
    
    
КонецФункции


Функция Сериализовать(Объект) 
    
    ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
    Запись = Новый ЗаписьJSON;
    Запись.УстановитьСтроку();
    ЗаписатьJSON(Запись, Объект);
    Возврат Запись.Закрыть();
    
КонецФункции
