
&НаКлиенте
Процедура Ок(Команда)
    
    ОповеститьОВыборе(_ОбщийМодульСервер.СохранитьHTML(КомментарийHTML));
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    _ОбщийМодульСервер.ЗаполнитьHTML(КомментарийHTML, Параметры.ДанныеКомментария);
    
КонецПроцедуры


//&НаКлиенте
//Процедура ВставитьИзБуфера(Команда)
//    КомпонентаУстановлена = РаботаСКартинкамиКлиент.ПроинициализироватьКомпоненту(); 
//    Если Не КомпонентаУстановлена Тогда 
//        Обработчик = Новый ОписаниеОповещения("ВставитьКартинкуИзБуфераЗавершение", ЭтотОбъект); 
//        РаботаСКартинкамиКлиент.УстановитьКомпоненту(Обработчик); 
//        Возврат; 
//    КонецЕсли; 
//    ВставитьКартинкуИзБуфераЗавершение(Истина, Неопределено); 
//КонецПроцедуры 

//&НаКлиенте 
//Процедура ВставитьКартинкуИзБуфераЗавершение(Результат, ПараметрыВыполнения) Экспорт 
//    Если Результат = Истина Тогда 
//        ПутьКФайлу = КомпонентаПолученияКартинкиИзБуфера.ПолучитьКартинкуИзБуфера(); 
//        Если Не ПустаяСтрока(ПутьКФайлу) Тогда 
//            Картинко = Новый Картинка(ПутьКФайлу); 
//            УдалитьФайлы(ПутьКФайлу); 
//            ПозицияНачала = 0; 
//            ПозицияОкончания = 0; 
//            Элементы.Описание.ПолучитьГраницыВыделения(ПозицияНачала,ПозицияОкончания); 
//            Начало = КомментарийHTML.ПолучитьПозициюПоЗакладке(ПозицияНачала); 
//            ВставитьКартинкуВКомментарийHTML(Картинко,Начало); 
//        Иначе 
//            ПоказатьПредупреждение(,НСтр("ru = 'Буфер обмена не содержит картинки'")); 
//        КонецЕсли; 
//    КонецЕсли; 
//КонецПроцедуры

//&НаСервере 
//Процедура ВставитьКартинкуВКомментарийHTML(Кар,Позиция) 
//    Закладка = КомментарийHTML.ПолучитьЗакладкуПоПозиции(Позиция); 
//    КомментарийHTML.Вставить(Закладка,Кар, Тип("КартинкаФорматированногоДокумента")); 
//КонецПроцедуры