
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    
    Попытка
        КогоПредупреждатьОбОкончанииИТС.ЗагрузитьЗначения(
            Константы._КогоПредупреждатьОбОкончанииИТС.Получить().Получить()); 
    Исключение
    КонецПопытки;
    
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    Константы._КогоПредупреждатьОбОкончанииИТСС.Установить( 
        Новый ХранилищеЗначения(КогоПредупреждатьОбОкончанииИТС.ВыгрузитьЗначения()));
    
КонецПроцедуры
