
&НаСервере
Процедура СотрудникПриИзмененииНаСервере(ОбъектЗаявка)
	Если ЗначениеЗаполнено(ОбъектЗаявка) тогда
        ОчиститьСпсокПриИзмененииНаСервере();
        ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
        ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
        ЭлементОтбора.Использование = Истина;
        ЭлементОтбора.ПравоеЗначение = ОбъектЗаявка;
	иначе
        ОчиститьСпсокПриИзмененииНаСервере();
		
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СписокЗН = ПолучитьНаСервереОбъектЗаявка(Сотрудник);
	СотрудникПриИзмененииНаСервере(СписокЗН);
КонецПроцедуры


&НаСервере
Функция ПолучитьНаСервереОбъектЗаявка(Сотрудник)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
        |   ЧекЛист.Заявка КАК ОбъектЗаявка
        |ИЗ
        |   РегистрСведений._РаботыЗаДень КАК ЧекЛист
        |ГДЕ
        |   ЧекЛист.Сотрудник = &Сотрудник
        |
        |СГРУППИРОВАТЬ ПО
        |   ЧекЛист.Заявка";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		СП = Новый СписокЗначений; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СП.Добавить(ВыборкаДетальныеЗаписи.ОбъектЗаявка);
	КонецЦикла;
	
    Возврат СП;

КонецФункции // ПолучитьНаСервереОбъектЗаявка(Сотрудник)()



&НаСервере
Процедура ОчиститьСпсокПриИзмененииНаСервере()
Список.Отбор.Элементы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСпсокПриИзменении(Элемент)
	Если не ОчиститьСпсок тогда
	ОчиститьСпсокПриИзмененииНаСервере();
иначе
	Если ЗначениеЗаполнено(Сотрудник) Тогда 
	СписокЗН = ПолучитьНаСервереОбъектЗаявка(Сотрудник);
	СотрудникПриИзмененииНаСервере(СписокЗН);
    КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОчиститьСпсок = Истина;
	Сотрудник = ПараметрыСеанса.ТекущийПользователь;
    СписокЗН = ПолучитьНаСервереОбъектЗаявка(Сотрудник);
	СотрудникПриИзмененииНаСервере(СписокЗН);
КонецПроцедуры
