
//Процедура ПередЗаписью(Отказ)
//    
//    Если Ссылка.Пустая() тогда
//        Автор = ПараметрыСеанса.ТекущийПользователь;
//    КонецЕсли;
//    
//    Если  Ссылка.Пустая() тогда
//        Текст = Символы.ПС + "*Добавлено вложение:* `" + Наименование + "." + Расширение + "`"; 
//        ДополнительныеСвойства.вставить("РассылкаОповещений",Текст);
//    КонецЕсли;

//КонецПроцедуры

//Процедура ПриЗаписи(Отказ)
//    
//    Текст = "";
//    если не Отказ и ДополнительныеСвойства.Свойство("РассылкаОповещений",Текст) тогда
//        Текст =  "*Изменения в заявке :*  " + Формат(число(ВладелецФайла.Номер), "ЧДЦ=0; ЧГ=0") + 
//        Символы.ПС + "*Контр-т*:  " + ВладелецФайла.Контрагент + 
//        Символы.ПС + "*Описание:*  " + ВладелецФайла.Название + Текст; 
//        
//        Параметры = Новый Массив;
//        Параметры.Добавить(ВладелецФайла.Смета.ВыгрузитьКолонку("Сотрудник"));
//        Параметры.Добавить(Текст);
//        Параметры.Добавить(ПараметрыСеанса.ТекущийПользователь);
//        Параметры.Добавить(ВладелецФайла.Ссылка);
//        
//        ФоновыеЗадания.Выполнить("КП_ОбщийМодуль.Рассылка", 
//        Параметры, Новый УникальныйИдентификатор,"Рассылка в телеграмм");      
//        
//    КонецЕсли;
//    
//КонецПроцедуры
