#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
		
    //НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ОтчетПоЗаявкам");
    //НастройкиВарианта.Описание =  "Отчет По Заявкам";
    //НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЧасыЗаДень");
    //НастройкиВарианта.Описание =  "Часы За День";
    //
    //НастройкиВарианта.Размещение.Очистить();
    //НастройкиВарианта.Размещение.Вставить(, "СмТакже");
		
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли