Функция ПолучитьДанныеБух() Экспорт
    
    перПорт = 0;
    перСервер = "192.168.6.150";
    перПользователь = "НикитинаЕ";
    перПароль = "1609";
    Соединение = Новый HTTPСоединение("192.168.6.150", , перПользователь, перПароль);
    
    
    
    
    Запрос = Новый HTTPЗапрос("/buh2020/hs/DataKontr/GetInfo");
    
    Ответ = Соединение.Получить(Запрос);
    
    Если Ответ.КодСостояния = 200 Тогда
        возврат ДеСериализовать(Ответ.ПолучитьТелоКакСтроку());
    Иначе
        Сообщить("Код ответа: "+Ответ.КодСостояния ); //анализируем код состояния и делаем выводы
        Сообщить(Ответ.ПолучитьТелоКакСтроку()); //получим HTML-код страницы 
    КонецЕсли;
    
КонецФункции

&Насервере
Функция ДеСериализовать(Строка) Экспорт 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	Возврат ПрочитатьJSON(ЧтениеJSON, Ложь);
	
КонецФункции

